

&НаКлиенте
Процедура Печать(Команда)

	ИмяМакета	= Элементы.СписокДоступныхФорм.ТекущиеДанные.Значение;	
	ТабДок		= Новый ТабличныйДокумент;
		
	ПечатьНаСервере(ТабДок, ИмяМакета, Параметры.Ссылка);
		
	ПараметрыФормы = Новый Структура("ТабДок", ТабДок);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Закрыть();	

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();

КонецПроцедуры


&НаСервере
Процедура ПечатьНаСервере(ТабДок, ИмяМакета, Ссылка)
	
	ДокументМенеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	ДокументМенеджер.Печать(ТабДок, Ссылка, ИмяМакета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ДокументМенеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Параметры.Ссылка);
	СтруктураПечатныхФорм = ДокументМенеджер.СтруктураПечатныхФорм();
	
	Для Каждого ЭлементПФ Из СтруктураПечатныхФорм Цикл
		
		СписокДоступныхФорм.Добавить(ЭлементПФ.Ключ, ЭлементПФ.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

