&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти 			= Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм		= РаботаСоСправочниками.УстановкаЕдИзм(СтрокаТабличнойЧасти.Номенклатура);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	      Объект.Склад = Справочники.Склады.Основной;
	      Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	 КонецЕсли;	  
		  
КонецПроцедуры

Функция ОстатокНаСкладе (Номенклатура, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Склад,
		|	ОстаткиТоваровОстатки.Номенклатура,
		|	ОстаткиТоваровОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.Склад = &Склад
		|	И ОстаткиТоваровОстатки.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


   	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
         ОстатокНоменклатуры = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокНоменклатуры = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	  //+ просчитываем резерв 160113

	РезервОснования = 0;
	Если  Объект.Заказ.Ссылка <> Документы.СчетФактура.ПустаяСсылка() тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервТоваровОстатки.количествоОстаток,
		|	РезервТоваровОстатки.Номенклатура,
		|	РезервТоваровОстатки.ДокументОснование
		|ИЗ
		|	РегистрНакопления.РезервТоваров.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад
		|				И ДокументОснование = &ДокументОснование) КАК РезервТоваровОстатки";
		
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Заказ.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезервОснования = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

КонецЕсли;
  Резерв = 0;
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервТоваровОстатки.количествоОстаток,
		|	РезервТоваровОстатки.Номенклатура,
		|	РезервТоваровОстатки.ДокументОснование
		|ИЗ
		|	РегистрНакопления.РезервТоваров.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК РезервТоваровОстатки";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Если Объект.Дата = НачалоДня(ТекущаяДата()) И ПустаяСтрока(Объект.Номер) Тогда
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;


	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Резерв = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	Если резерв < 0 Тогда
		резерв = 0;
	КонецЕсли;
	Если РезервОснования < 0 Тогда 
		РезервОснования =0; 
	КонецЕсли;
	
	ВсегоРезерв = Резерв - резервОснования;
	
	ОстатокНоменклатуры = ОстатокНоменклатуры - ВсегоРезерв;
    //- просчитываем резерв 160113
	
	
	Возврат   ОстатокНоменклатуры;
КонецФункции

 &НаСервере
 Функция РольПользователя(Роль)
	 
	 Возврат	РольДоступна(Роль);
	 
 КонецФункции
 
// отрабатываем подбор
&НаКлиенте
Процедура Подбор(Команда)
			
	ПараметрыФормы = Новый Структура ("Склад", Объект.Склад);
		
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", 
			ПараметрыФормы, 
			,
			,
			,
			,
			Новый ОписаниеОповещения("ОбработатьРезультатПодбора", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПодбора(ПараметрЗакрытия, Парам2) Экспорт
	
	Если ПараметрЗакрытия <> Неопределено Тогда	
		
		ОбработатьПодборНаСервере(ПараметрЗакрытия);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборНаСервере(АдресВХранилище)
			
	Таблица = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТаблицы.Номенклатура));
		
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТаблицы.Номенклатура;
			НоваяСтрока.ЕдИзм = СтрокаТаблицы.Номенклатура.ЕдИзм; 
			НоваяСтрока.Количество = СтрокаТаблицы.Количество; 						
		Иначе
			Строка = МассивСтрок[0];			
			Строка.Количество = Строка.Количество + СтрокаТаблицы.Количество;			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

// отрабатываем подбор
&НаКлиенте
 Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сч 		=  проверкаНаличия(ВыбранноеЗначение);
	 
	 Если Сч = 0 Тогда
		 Элементы.Товары.ДобавитьСтроку();
		 Элементы.Товары.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;
		 ЗаполнитьДанные(Элементы.Товары.ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.НомерСтроки);
	 КонецЕсли
 КонецПроцедуры
         // отрабатываем подбор
 &НаСервере
Функция проверкаНаличия(ВыбранноеЗначение)	
			Сч = 0;
	 Для каждого Строч Из Объект.Товары Цикл
		 Если Строч.Номенклатура 	= ВыбранноеЗначение тогда
			 Строч.Количество 		= Строч.Количество + 1;// Если товар уже есть - то просто приплюсуем его;

			 Сч = 1;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат Сч;
КонецФункции	
         // отрабатываем подбор
&НаСервере
Процедура  ЗаполнитьДанные(товар, строка)
		
		Для каждого строч из Объект.Товары Цикл
			Если Строч.НомерСтроки = Строка Тогда
				
				Строч.ЕдИзм				= Товар.ЕдИзм;
				Строч.Количество		= 1;
								
			КонецЕсли;
			
		КонецЦикла;
		
КонецПроцедуры
	
	
	
	

   
  





 
 
	