 
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Склад 			= Склад;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Количество 	= ТекСтрокаТовары.Количество;
		Движение.ЕдИзм			= ТекСтрокаТовары.ЕдИзм;
		
		// Добавить пересчет единиц измерения
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		НомерИсхДокумента = ДанныеЗаполнения.НомерВхДокумента;
		Ответственный	  = ДанныеЗаполнения.Ответственный;
		ВидОперации		  = ДанныеЗаполнения.ВидОперации;
		Склад			  = ДанныеЗаполнения.Склад;
		
		// Заполнение табличной части
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдИзм = ТекСтрокаТовары.ЕдИзм;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры


  