Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Склад 			= Склад;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;		
		Движение.Количество 	= ТекСтрокаТовары.Количество;
		Движение.ЕдИзм			= ТекСтрокаТовары.ЕдИзм;
		
		// Добавить пересчет единиц измерения
	КонецЦикла;

КонецПроцедуры

