

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Склад 			= СкладОтправитель;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;		
		Движение.Количество 	= ТекСтрокаТовары.Количество;

		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Склад 			= СкладПолучатель;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;		
		Движение.Количество 	= ТекСтрокаТовары.Количество;
		
		// Добавить пересчет единиц измерения		
	КонецЦикла;
	
КонецПроцедуры
