Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
      
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];      
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат Документы[ИмяОбъекта];      
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат БизнесПроцессы[ИмяОбъекта];      
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];      
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];      
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат ПланыВидовРасчета[ИмяОбъекта];      
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат Задачи[ИмяОбъекта];     
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат ПланыОбмена[ИмяОбъекта];      
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда      
		Возврат Перечисления[ИмяОбъекта];      
	Иначе      
		Возврат НеОпределено;      
	КонецЕсли;

КонецФункции

Функция ЗаполненаТабличнаяЧастьДокумента(ДокОбъект, ИмяТабЧасти = "Товары") Экспорт
	
	Возврат НЕ ДокОбъект[ИмяТабЧасти].Количество() = 0;
	
КонецФункции

Процедура ДокументПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ЗаполненаТабличнаяЧастьДокумента(Источник, "Товары");
		
		Если Отказ Тогда
			Сообщить("Не заполнена табличная часть.");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
