 
 //***************************************************************************************************

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение 				= Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Склад 			= Склад;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.ВидОпераций    = ТекСтрокаТовары.ВидОпераций;
		Движение.Количество 	= ТекСтрокаТовары.Количество;
	КонецЦикла;
	//=================================

КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияТоваров") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Кво = ТекСтрокаТовары.Количество - ТекСтрокаТовары.КоличествоУчет;
			Если Кво > 0 Тогда
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдИзм = ТекСтрокаТовары.ЕдИзм;
			НоваяСтрока.Количество = Кво;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ВидОпераций  = ТекСтрокаТовары.ВидОпераций;
			КонецЕсли;
			

		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
КонецПроцедуры

