
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Наименование,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование";
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		     Запрос.Текст = Запрос.Текст  +"
		       | И Номенклатура.ССылка <> &ССылка";
			   
	         Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	   КонецЕсли;	 

	Запрос.УстановитьПараметр("Наименование", СокрЛП(Объект.Наименование));

	Результат = Запрос.Выполнить().Выгрузить();

	Если Результат.Количество() > 0 тогда
	     Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Товар с таким именем существует";
		 Сообщение.Сообщить(); 
		 Отказ = Истина;
	КонецЕсли;	 
	
КонецПроцедуры
